[
        [
            "students",
            8800
        ],
        [
            "ksu",
            5639
        ],
        [
            "kennesaw",
            5591
        ],
        [
            "student",
            5387
        ],
        [
            "resources",
            4730
        ],
        [
            "state",
            4343
        ],
        [
            "faculty",
            4339
        ],
        [
            "education",
            4320
        ],
        [
            "research",
            4230
        ],
        [
            "campus",
            4191
        ],
        [
            "alumni",
            3958
        ],
        [
            "university",
            3933
        ],
        [
            "business",
            3866
        ],
        [
            "college",
            3750
        ],
        [
            "information",
            3701
        ],
        [
            "community",
            3613
        ],
        [
            "online",
            3451
        ],
        [
            "staff",
            3311
        ],
        [
            "program",
            2864
        ],
        [
            "family",
            2842
        ],
        [
            "programs",
            2792
        ],
        [
            "current",
            2760
        ],
        [
            "marietta",
            2599
        ],
        [
            "friends",
            2571
        ],
        [
            "2024",
            2565
        ],
        [
            "engineering",
            2549
        ],
        [
            "parents",
            2483
        ],
        [
            "contact",
            2302
        ],
        [
            "financial",
            2271
        ],
        [
            "aid",
            2245
        ],
        [
            "ga",
            2221
        ],
        [
            "apply",
            2129
        ],
        [
            "visit",
            2099
        ],
        [
            "center",
            2025
        ],
        [
            "2025",
            2012
        ],
        [
            "give",
            1941
        ],
        [
            "degrees",
            1917
        ],
        [
            "calendar",
            1891
        ],
        [
            "skip",
            1757
        ],
        [
            "graduate",
            1611
        ],
        [
            "work",
            1571
        ],
        [
            "share",
            1565
        ],
        [
            "department",
            1532
        ],
        [
            "life",
            1528
        ],
        [
            "opportunities",
            1520
        ],
        [
            "related",
            1486
        ],
        [
            "professional",
            1447
        ],
        [
            "academic",
            1422
        ],
        [
            "info",
            1410
        ],
        [
            "global",
            1400
        ],
        [
            "technology",
            1393
        ],
        [
            "us",
            1367
        ],
        [
            "job",
            1357
        ],
        [
            "degree",
            1341
        ],
        [
            "science",
            1318
        ],
        [
            "security",
            1310
        ],
        [
            "majors",
            1299
        ],
        [
            "human",
            1293
        ],
        [
            "admissions",
            1291
        ],
        [
            "learning",
            1263
        ],
        [
            "media",
            1254
        ],
        [
            "open",
            1254
        ],
        [
            "main",
            1234
        ],
        [
            "management",
            1217
        ],
        [
            "report",
            1205
        ],
        [
            "courses",
            1201
        ],
        [
            "school",
            1190
        ],
        [
            "certificate",
            1176
        ],
        [
            "services",
            1165
        ],
        [
            "athletics",
            1164
        ],
        [
            "30144",
            1159
        ],
        [
            "academics",
            1143
        ],
        [
            "privacy",
            1096
        ],
        [
            "accreditation",
            1078
        ],
        [
            "hours",
            1069
        ],
        [
            "statement",
            1067
        ],
        [
            "text",
            1066
        ],
        [
            "housing",
            1058
        ],
        [
            "notice",
            1054
        ],
        [
            "rights",
            1052
        ],
        [
            "records",
            1051
        ],
        [
            "south",
            1041
        ],
        [
            "feedback",
            1039
        ],
        [
            "undergraduate",
            1037
        ],
        [
            "leadership",
            1036
        ],
        [
            "events",
            1030
        ],
        [
            "links",
            1029
        ],
        [
            "30060",
            1015
        ],
        [
            "registrar",
            1012
        ],
        [
            "reserved",
            1006
        ],
        [
            "maps",
            1002
        ],
        [
            "menu",
            998
        ],
        [
            "emergency",
            992
        ],
        [
            "libraries",
            989
        ],
        [
            "follow",
            989
        ],
        [
            "accessibility",
            987
        ],
        [
            "sustainability",
            980
        ],
        [
            "chastain",
            976
        ],
        [
            "social",
            956
        ],
        [
            "concern",
            956
        ],
        [
            "learn",
            952
        ],
        [
            "may",
            948
        ],
        [
            "new",
            946
        ],
        [
            "design",
            945
        ],
        [
            "trafficking",
            944
        ],
        [
            "email",
            936
        ],
        [
            "career",
            934
        ],
        [
            "professor",
            920
        ],
        [
            "development",
            918
        ],
        [
            "470ksuinfo",
            917
        ],
        [
            "4705784636",
            914
        ],
        [
            "pkwymarietta",
            910
        ],
        [
            "roadkennesaw",
            905
        ],
        [
            "pa",
            905
        ],
        [
            "kennesaweduinfo",
            903
        ],
        [
            "campus1100",
            902
        ],
        [
            "campus1000",
            900
        ],
        [
            "phone470ksuinfo4705784636",
            899
        ],
        [
            "minor",
            895
        ],
        [
            "sitea",
            889
        ],
        [
            "support",
            884
        ],
        [
            "1",
            859
        ],
        [
            "health",
            851
        ],
        [
            "arts",
            837
        ],
        [
            "office",
            835
        ],
        [
            "course",
            835
        ],
        [
            "content",
            830
        ],
        [
            "link",
            782
        ],
        [
            "study",
            775
        ],
        [
            "success",
            764
        ],
        [
            "bagwell",
            762
        ],
        [
            "please",
            759
        ],
        [
            "application",
            755
        ],
        [
            "teacher",
            754
        ],
        [
            "must",
            732
        ],
        [
            "start",
            715
        ],
        [
            "coles",
            709
        ],
        [
            "event",
            705
        ],
        [
            "experience",
            703
        ],
        [
            "data",
            700
        ],
        [
            "georgia",
            696
        ],
        [
            "date",
            695
        ],
        [
            "session",
            688
        ],
        [
            "site",
            687
        ],
        [
            "dr",
            683
        ],
        [
            "spring",
            677
        ],
        [
            "systems",
            667
        ],
        [
            "well",
            663
        ],
        [
            "phone",
            655
        ],
        [
            "tour",
            650
        ],
        [
            "resource",
            649
        ],
        [
            "one",
            648
        ],
        [
            "field",
            648
        ],
        [
            "features",
            644
        ],
        [
            "location",
            633
        ],
        [
            "fall",
            627
        ],
        [
            "public",
            622
        ],
        [
            "affairs",
            619
        ],
        [
            "international",
            618
        ],
        [
            "year",
            611
        ],
        [
            "software",
            609
        ],
        [
            "credit",
            606
        ],
        [
            "service",
            603
        ],
        [
            "make",
            596
        ],
        [
            "navigation",
            593
        ],
        [
            "also",
            592
        ],
        [
            "skills",
            591
        ],
        [
            "time",
            582
        ],
        [
            "footer",
            581
        ],
        [
            "deadlines",
            581
        ],
        [
            "training",
            580
        ],
        [
            "activities",
            577
        ],
        [
            "request",
            575
        ],
        [
            "teaching",
            571
        ],
        [
            "help",
            569
        ],
        [
            "art",
            569
        ],
        [
            "digital",
            566
        ],
        [
            "provide",
            561
        ],
        [
            "computer",
            551
        ],
        [
            "requirements",
            544
        ],
        [
            "exhibition",
            543
        ],
        [
            "search",
            541
        ],
        [
            "studio",
            537
        ],
        [
            "radow",
            533
        ],
        [
            "p",
            532
        ],
        [
            "dec",
            531
        ],
        [
            "available",
            530
        ],
        [
            "j",
            528
        ],
        [
            "studies",
            527
        ],
        [
            "000000",
            519
        ],
        [
            "educational",
            517
        ],
        [
            "museum",
            516
        ],
        [
            "architecture",
            506
        ],
        [
            "construction",
            506
        ],
        [
            "including",
            505
        ],
        [
            "dont",
            505
        ],
        [
            "use",
            496
        ],
        [
            "scholarships",
            495
        ],
        [
            "scholarship",
            489
        ],
        [
            "team",
            487
        ],
        [
            "news",
            484
        ],
        [
            "building",
            482
        ],
        [
            "semester",
            482
        ],
        [
            "required",
            477
        ],
        [
            "curriculum",
            476
        ],
        [
            "honors",
            475
        ],
        [
            "classroom",
            470
        ],
        [
            "sciences",
            469
        ],
        [
            "zuckerman",
            468
        ],
        [
            "2",
            467
        ],
        [
            "name",
            464
        ],
        [
            "major",
            462
        ],
        [
            "national",
            461
        ],
        [
            "writing",
            460
        ],
        [
            "knowledge",
            457
        ],
        [
            "project",
            456
        ],
        [
            "assistant",
            454
        ],
        [
            "questions",
            453
        ],
        [
            "first",
            447
        ],
        [
            "computing",
            446
        ],
        [
            "day",
            444
        ],
        [
            "interested",
            441
        ],
        [
            "home",
            438
        ],
        [
            "need",
            436
        ],
        [
            "complete",
            435
        ],
        [
            "term",
            434
        ],
        [
            "years",
            432
        ],
        [
            "foundation",
            431
        ],
        [
            "javascript",
            429
        ],
        [
            "experiences",
            427
        ],
        [
            "clinical",
            427
        ],
        [
            "master",
            427
        ],
        [
            "teachers",
            423
        ],
        [
            "marketing",
            421
        ],
        [
            "part",
            420
        ],
        [
            "using",
            413
        ],
        [
            "facebook",
            413
        ],
        [
            "ii",
            405
        ],
        [
            "sign",
            402
        ],
        [
            "linkedin",
            402
        ],
        [
            "owl",
            400
        ],
        [
            "world",
            400
        ],
        [
            "might",
            399
        ],
        [
            "members",
            397
        ],
        [
            "couwenberg",
            396
        ],
        [
            "system",
            394
        ],
        [
            "activity",
            393
        ],
        [
            "advising",
            393
        ],
        [
            "language",
            392
        ],
        [
            "award",
            392
        ],
        [
            "personal",
            390
        ],
        [
            "two",
            389
        ],
        [
            "enabled",
            388
        ],
        [
            "cultural",
            387
        ],
        [
            "virtual",
            384
        ],
        [
            "access",
            383
        ],
        [
            "engagement",
            383
        ],
        [
            "registration",
            383
        ],
        [
            "policy",
            382
        ],
        [
            "last",
            382
        ],
        [
            "take",
            381
        ],
        [
            "process",
            381
        ],
        [
            "abroad",
            381
        ],
        [
            "series",
            381
        ],
        [
            "twitter",
            378
        ],
        [
            "type",
            377
        ],
        [
            "instructional",
            377
        ],
        [
            "get",
            377
        ],
        [
            "future",
            376
        ],
        [
            "grades",
            374
        ],
        [
            "early",
            374
        ],
        [
            "methods",
            374
        ],
        [
            "innovation",
            373
        ],
        [
            "associate",
            373
        ],
        [
            "end",
            373
        ],
        [
            "correctly",
            369
        ],
        [
            "following",
            367
        ],
        [
            "dean",
            364
        ],
        [
            "offers",
            363
        ],
        [
            "admission",
            361
        ],
        [
            "funding",
            360
        ],
        [
            "oops",
            360
        ],
        [
            "classes",
            358
        ],
        [
            "group",
            356
        ],
        [
            "number",
            356
        ],
        [
            "industry",
            356
        ],
        [
            "sports",
            354
        ],
        [
            "sessions",
            354
        ],
        [
            "educators",
            352
        ],
        [
            "stay",
            351
        ],
        [
            "ai",
            348
        ],
        [
            "provides",
            343
        ],
        [
            "room",
            343
        ],
        [
            "attendance",
            342
        ],
        [
            "november",
            342
        ],
        [
            "special",
            341
        ],
        [
            "3",
            340
        ],
        [
            "general",
            340
        ],
        [
            "designed",
            339
        ],
        [
            "summer",
            338
        ],
        [
            "see",
            335
        ],
        [
            "form",
            335
        ],
        [
            "page",
            335
        ],
        [
            "opportunity",
            333
        ],
        [
            "tuition",
            333
        ],
        [
            "find",
            332
        ],
        [
            "humanities",
            332
        ],
        [
            "within",
            332
        ],
        [
            "projects",
            332
        ],
        [
            "culture",
            331
        ],
        [
            "15",
            330
        ],
        [
            "middle",
            328
        ],
        [
            "coordinator",
            328
        ],
        [
            "director",
            327
        ],
        [
            "week",
            326
        ],
        [
            "website",
            325
        ],
        [
            "enroll",
            325
        ],
        [
            "470",
            325
        ],
        [
            "meet",
            323
        ],
        [
            "committee",
            321
        ],
        [
            "federal",
            320
        ],
        [
            "pm",
            320
        ],
        [
            "norman",
            320
        ],
        [
            "policies",
            318
        ],
        [
            "recreation",
            317
        ],
        [
            "planning",
            316
        ],
        [
            "7",
            314
        ],
        [
            "class",
            314
        ],
        [
            "paper",
            314
        ],
        [
            "informationbagwell",
            313
        ],
        [
            "receive",
            311
        ],
        [
            "benefits",
            311
        ],
        [
            "includes",
            309
        ],
        [
            "teams",
            308
        ],
        [
            "submit",
            307
        ],
        [
            "additional",
            307
        ],
        [
            "collections",
            307
        ],
        [
            "delivery",
            306
        ],
        [
            "departments",
            304
        ],
        [
            "click",
            304
        ],
        [
            "bcoe",
            303
        ],
        [
            "april",
            303
        ],
        [
            "join",
            301
        ],
        [
            "fees",
            301
        ],
        [
            "include",
            301
        ],
        [
            "check",
            300
        ],
        [
            "executive",
            300
        ],
        [
            "polytechnic",
            299
        ],
        [
            "cost",
            296
        ],
        [
            "best",
            296
        ],
        [
            "history",
            296
        ],
        [
            "american",
            295
        ],
        [
            "circles",
            294
        ],
        [
            "many",
            293
        ],
        [
            "topics",
            293
        ],
        [
            "lab",
            293
        ],
        [
            "sewing",
            293
        ],
        [
            "organizations",
            292
        ],
        [
            "full",
            292
        ],
        [
            "book",
            292
        ],
        [
            "schools",
            291
        ],
        [
            "10",
            290
        ],
        [
            "loan",
            290
        ],
        [
            "review",
            289
        ],
        [
            "bachelor",
            288
        ],
        [
            "im",
            288
        ],
        [
            "5",
            287
        ],
        [
            "25",
            287
        ],
        [
            "grant",
            286
        ],
        [
            "practice",
            286
        ],
        [
            "elementary",
            285
        ],
        [
            "offer",
            285
        ],
        [
            "30",
            284
        ],
        [
            "english",
            284
        ],
        [
            "homeabout",
            283
        ],
        [
            "commencement",
            282
        ],
        [
            "specific",
            281
        ],
        [
            "completed",
            281
        ],
        [
            "days",
            281
        ],
        [
            "connected",
            280
        ],
        [
            "childhood",
            279
        ],
        [
            "total",
            278
        ],
        [
            "internships",
            278
        ],
        [
            "wellness",
            277
        ],
        [
            "top",
            277
        ],
        [
            "music",
            277
        ],
        [
            "completion",
            277
        ],
        [
            "accounting",
            276
        ],
        [
            "mathematics",
            275
        ],
        [
            "2023",
            275
        ],
        [
            "list",
            273
        ],
        [
            "parttime",
            272
        ],
        [
            "lacour",
            270
        ],
        [
            "folded",
            270
        ],
        [
            "vessels",
            270
        ],
        [
            "papermaking",
            270
        ],
        [
            "council",
            269
        ],
        [
            "december",
            268
        ],
        [
            "various",
            267
        ],
        [
            "catalog",
            266
        ],
        [
            "impact",
            266
        ],
        [
            "masters",
            265
        ],
        [
            "careers",
            264
        ],
        [
            "instructor",
            264
        ],
        [
            "price",
            263
        ],
        [
            "institution",
            262
        ],
        [
            "cybersecurity",
            262
        ],
        [
            "pathway",
            262
        ],
        [
            "6",
            261
        ],
        [
            "processes",
            258
        ],
        [
            "private",
            258
        ],
        [
            "needs",
            257
        ],
        [
            "analytics",
            257
        ],
        [
            "snapshot",
            257
        ],
        [
            "andor",
            256
        ],
        [
            "ksus",
            254
        ],
        [
            "areas",
            254
        ],
        [
            "attend",
            254
        ],
        [
            "administration",
            253
        ],
        [
            "4",
            253
        ],
        [
            "senior",
            253
        ],
        [
            "high",
            252
        ],
        [
            "certification",
            252
        ],
        [
            "analysis",
            251
        ],
        [
            "issues",
            250
        ],
        [
            "finance",
            250
        ],
        [
            "teach",
            250
        ],
        [
            "create",
            247
        ],
        [
            "journey",
            247
        ],
        [
            "southern",
            244
        ],
        [
            "fields",
            243
        ],
        [
            "advanced",
            243
        ],
        [
            "right",
            242
        ],
        [
            "atlanta",
            241
        ],
        [
            "like",
            241
        ],
        [
            "options",
            238
        ],
        [
            "graduation",
            236
        ],
        [
            "secondary",
            236
        ],
        [
            "currently",
            236
        ],
        [
            "resourcesfaculty",
            236
        ],
        [
            "read",
            236
        ],
        [
            "eligible",
            235
        ],
        [
            "artistinresidence",
            235
        ],
        [
            "develop",
            234
        ],
        [
            "institutions",
            234
        ],
        [
            "login",
            233
        ],
        [
            "na",
            233
        ],
        [
            "12",
            232
        ],
        [
            "workshop",
            232
        ],
        [
            "final",
            232
        ],
        [
            "communication",
            231
        ],
        [
            "disciplines",
            229
        ],
        [
            "michael",
            229
        ],
        [
            "sure",
            228
        ],
        [
            "environmental",
            228
        ],
        [
            "association",
            227
        ],
        [
            "leaders",
            227
        ],
        [
            "performance",
            227
        ],
        [
            "20",
            227
        ],
        [
            "partnerships",
            226
        ],
        [
            "entrepreneurship",
            225
        ],
        [
            "offering",
            223
        ],
        [
            "present",
            223
        ],
        [
            "based",
            222
        ],
        [
            "connections",
            221
        ],
        [
            "grants",
            220
        ],
        [
            "healthcare",
            219
        ],
        [
            "higher",
            219
        ],
        [
            "dates",
            218
        ],
        [
            "economics",
            218
        ],
        [
            "sales",
            218
        ],
        [
            "view",
            217
        ],
        [
            "coops",
            217
        ],
        [
            "certificates",
            215
        ],
        [
            "status",
            215
        ],
        [
            "focuses",
            215
        ],
        [
            "prior",
            214
        ],
        [
            "important",
            214
        ],
        [
            "plan",
            213
        ],
        [
            "annual",
            213
        ],
        [
            "interest",
            212
        ],
        [
            "explore",
            212
        ],
        [
            "outreach",
            212
        ],
        [
            "manager",
            212
        ],
        [
            "presented",
            211
        ],
        [
            "programsgraduate",
            210
        ],
        [
            "love",
            209
        ],
        [
            "schedule",
            209
        ],
        [
            "applications",
            209
        ],
        [
            "professionals",
            209
        ],
        [
            "cherokee",
            209
        ],
        [
            "march",
            208
        ],
        [
            "mba",
            207
        ],
        [
            "large",
            207
        ],
        [
            "member",
            207
        ],
        [
            "log",
            207
        ],
        [
            "artist",
            207
        ],
        [
            "1pm",
            206
        ],
        [
            "web",
            205
        ],
        [
            "go",
            205
        ],
        [
            "transfer",
            205
        ],
        [
            "2022",
            205
        ],
        [
            "individual",
            204
        ],
        [
            "description",
            204
        ],
        [
            "enrolled",
            203
        ],
        [
            "way",
            203
        ],
        [
            "next",
            203
        ],
        [
            "via",
            202
        ],
        [
            "graduates",
            200
        ],
        [
            "government",
            200
        ],
        [
            "included",
            200
        ],
        [
            "10am",
            200
        ],
        [
            "doctoral",
            199
        ],
        [
            "game",
            199
        ],
        [
            "advisory",
            199
        ],
        [
            "used",
            199
        ],
        [
            "write",
            199
        ],
        [
            "tools",
            198
        ],
        [
            "tomorrow",
            198
        ],
        [
            "minors",
            197
        ],
        [
            "competition",
            197
        ],
        [
            "conduct",
            197
        ],
        [
            "ccse",
            197
        ],
        [
            "mission",
            196
        ],
        [
            "welcome",
            196
        ],
        [
            "three",
            196
        ],
        [
            "annet",
            196
        ],
        [
            "innovative",
            195
        ],
        [
            "connect",
            195
        ],
        [
            "prepare",
            193
        ],
        [
            "goals",
            193
        ],
        [
            "provided",
            193
        ],
        [
            "free",
            192
        ],
        [
            "want",
            192
        ],
        [
            "ms",
            192
        ],
        [
            "literacy",
            192
        ],
        [
            "wilson",
            191
        ],
        [
            "presentation",
            191
        ],
        [
            "jordan",
            191
        ],
        [
            "care",
            190
        ],
        [
            "environment",
            190
        ],
        [
            "chair",
            190
        ],
        [
            "recovery",
            189
        ],
        [
            "register",
            189
        ],
        [
            "account",
            189
        ],
        [
            "organization",
            189
        ],
        [
            "legal",
            189
        ],
        [
            "young",
            188
        ],
        [
            "across",
            188
        ],
        [
            "area",
            188
        ],
        [
            "excellence",
            187
        ],
        [
            "president",
            187
        ],
        [
            "level",
            187
        ],
        [
            "taught",
            187
        ],
        [
            "gibson",
            187
        ],
        [
            "seminar",
            186
        ],
        [
            "among",
            185
        ],
        [
            "address",
            185
        ],
        [
            "holiday",
            185
        ],
        [
            "medical",
            185
        ],
        [
            "former",
            185
        ],
        [
            "az",
            184
        ],
        [
            "counseling",
            184
        ],
        [
            "states",
            184
        ],
        [
            "enrollment",
            184
        ],
        [
            "multiple",
            184
        ],
        [
            "coursework",
            184
        ],
        [
            "civil",
            183
        ],
        [
            "working",
            183
        ],
        [
            "looking",
            183
        ],
        [
            "library",
            182
        ],
        [
            "9",
            182
        ],
        [
            "mental",
            182
        ],
        [
            "july",
            182
        ],
        [
            "jeffrey",
            182
        ],
        [
            "monday",
            181
        ],
        [
            "corporate",
            181
        ],
        [
            "workshops",
            181
        ],
        [
            "spceet",
            181
        ],
        [
            "11",
            180
        ],
        [
            "assistance",
            180
        ],
        [
            "centers",
            180
        ],
        [
            "participate",
            180
        ],
        [
            "every",
            180
        ],
        [
            "2021",
            180
        ],
        [
            "lecture",
            180
        ],
        [
            "schnitzer",
            180
        ],
        [
            "core",
            179
        ],
        [
            "mister",
            179
        ],
        [
            "military",
            177
        ],
        [
            "october",
            177
        ],
        [
            "fee",
            177
        ],
        [
            "feb",
            177
        ],
        [
            "youll",
            176
        ],
        [
            "internship",
            176
        ],
        [
            "advisor",
            176
        ],
        [
            "printing",
            176
        ],
        [
            "colleges",
            175
        ],
        [
            "asked",
            175
        ],
        [
            "beb",
            175
        ],
        [
            "become",
            174
        ],
        [
            "providing",
            174
        ],
        [
            "select",
            174
        ],
        [
            "technical",
            174
        ],
        [
            "intelligence",
            173
        ],
        [
            "change",
            173
        ],
        [
            "america",
            172
        ],
        [
            "gpa",
            172
        ],
        [
            "guide",
            171
        ],
        [
            "applied",
            171
        ],
        [
            "safety",
            170
        ],
        [
            "focus",
            170
        ],
        [
            "board",
            170
        ],
        [
            "numerous",
            169
        ],
        [
            "critical",
            169
        ],
        [
            "note",
            168
        ],
        [
            "jan",
            168
        ],
        [
            "know",
            167
        ],
        [
            "hall",
            167
        ],
        [
            "newsbagwell",
            167
        ],
        [
            "january",
            167
        ],
        [
            "leader",
            166
        ],
        [
            "partners",
            166
        ],
        [
            "understanding",
            166
        ],
        [
            "individuals",
            166
        ],
        [
            "entertainment",
            164
        ],
        [
            "engage",
            164
        ],
        [
            "place",
            164
        ],
        [
            "law",
            164
        ],
        [
            "rsvp",
            164
        ],
        [
            "bs",
            164
        ],
        [
            "established",
            164
        ],
        [
            "choose",
            163
        ],
        [
            "facilities",
            163
        ],
        [
            "save",
            163
        ],
        [
            "growth",
            161
        ],
        [
            "awareness",
            161
        ],
        [
            "due",
            161
        ],
        [
            "apr",
            161
        ],
        [
            "diverse",
            160
        ],
        [
            "variety",
            160
        ],
        [
            "materials",
            160
        ],
        [
            "math",
            160
        ],
        [
            "made",
            159
        ],
        [
            "expertise",
            159
        ],
        [
            "guest",
            159
        ],
        [
            "effective",
            159
        ],
        [
            "bachelors",
            158
        ],
        [
            "mechanical",
            158
        ],
        [
            "phd",
            158
        ],
        [
            "partnership",
            157
        ],
        [
            "usbagwell",
            157
        ],
        [
            "hand",
            157
        ],
        [
            "2020",
            157
        ],
        [
            "employee",
            156
        ],
        [
            "funds",
            156
        ],
        [
            "24",
            156
        ],
        [
            "2nd",
            155
        ],
        [
            "per",
            155
        ],
        [
            "north",
            154
        ],
        [
            "value",
            154
        ],
        [
            "interdisciplinary",
            154
        ],
        [
            "black",
            154
        ],
        [
            "quantitative",
            154
        ],
        [
            "c",
            154
        ],
        [
            "upon",
            154
        ],
        [
            "28",
            154
        ],
        [
            "craft",
            154
        ],
        [
            "strategic",
            153
        ],
        [
            "call",
            153
        ],
        [
            "initiatives",
            153
        ],
        [
            "would",
            153
        ],
        [
            "candidates",
            153
        ],
        [
            "youre",
            152
        ],
        [
            "principles",
            152
        ],
        [
            "offered",
            152
        ],
        [
            "universitys",
            152
        ],
        [
            "addition",
            152
        ],
        [
            "least",
            152
        ],
        [
            "drawing",
            152
        ],
        [
            "practices",
            151
        ],
        [
            "mechatronics",
            151
        ],
        [
            "overview",
            151
        ],
        [
            "able",
            150
        ],
        [
            "response",
            150
        ],
        [
            "walking",
            150
        ],
        [
            "minimum",
            150
        ],
        [
            "dining",
            149
        ],
        [
            "double",
            149
        ],
        [
            "space",
            149
        ],
        [
            "23",
            149
        ],
        [
            "break",
            149
        ],
        [
            "iii",
            149
        ],
        [
            "appropriate",
            149
        ],
        [
            "va",
            149
        ],
        [
            "friday",
            148
        ],
        [
            "works",
            148
        ],
        [
            "beth",
            148
        ],
        [
            "pleased",
            148
        ],
        [
            "artificial",
            147
        ],
        [
            "ways",
            147
        ],
        [
            "appointment",
            147
        ],
        [
            "installation",
            147
        ],
        [
            "purpose",
            146
        ],
        [
            "18",
            146
        ],
        [
            "said",
            146
        ],
        [
            "covers",
            146
        ],
        [
            "arizona",
            146
        ],
        [
            "ready",
            145
        ],
        [
            "tours",
            145
        ],
        [
            "retention",
            145
        ],
        [
            "olli",
            145
        ],
        [
            "northern",
            145
        ],
        [
            "contemporary",
            145
        ],
        [
            "live",
            144
        ],
        [
            "whether",
            144
        ],
        [
            "better",
            144
        ],
        [
            "awarded",
            144
        ],
        [
            "plus",
            144
        ],
        [
            "sculpture",
            144
        ],
        [
            "randolph",
            144
        ],
        [
            "lighting",
            144
        ],
        [
            "potential",
            143
        ],
        [
            "diversity",
            143
        ],
        [
            "division",
            143
        ],
        [
            "prospective",
            143
        ],
        [
            "awards",
            143
        ],
        [
            "video",
            143
        ],
        [
            "people",
            143
        ],
        [
            "artpthe",
            143
        ],
        [
            "parking",
            142
        ],
        [
            "serve",
            142
        ],
        [
            "promotion",
            142
        ],
        [
            "progress",
            142
        ],
        [
            "trio",
            142
        ],
        [
            "limit",
            142
        ],
        [
            "eligibility",
            142
        ],
        [
            "27",
            142
        ],
        [
            "walls",
            142
        ],
        [
            "esports",
            141
        ],
        [
            "quality",
            141
        ],
        [
            "title",
            141
        ],
        [
            "placements",
            141
        ],
        [
            "june",
            141
        ],
        [
            "salary",
            141
        ],
        [
            "instruction",
            140
        ],
        [
            "deadline",
            140
        ],
        [
            "loans",
            140
        ],
        [
            "ranging",
            140
        ],
        [
            "order",
            139
        ],
        [
            "lead",
            139
        ],
        [
            "received",
            139
        ],
        [
            "dissertation",
            139
        ],
        [
            "introduction",
            139
        ],
        [
            "fine",
            139
        ],
        [
            "followed",
            139
        ],
        [
            "bailey",
            138
        ],
        [
            "meeting",
            138
        ],
        [
            "places",
            138
        ],
        [
            "different",
            138
        ],
        [
            "speakers",
            138
        ],
        [
            "adult",
            137
        ],
        [
            "results",
            137
        ],
        [
            "yearlong",
            137
        ],
        [
            "mountains",
            137
        ],
        [
            "printmaking",
            137
        ],
        [
            "psychological",
            136
        ],
        [
            "society",
            136
        ],
        [
            "nursing",
            136
        ],
        [
            "8",
            136
        ],
        [
            "gain",
            136
        ],
        [
            "four",
            136
        ],
        [
            "travel",
            136
        ],
        [
            "asia",
            136
        ],
        [
            "employees",
            135
        ],
        [
            "inperson",
            135
        ],
        [
            "womens",
            135
        ],
        [
            "scholars",
            135
        ],
        [
            "valleys",
            135
        ],
        [
            "lacours",
            135
        ],
        [
            "sculptural",
            135
        ],
        [
            "reliefs",
            135
        ],
        [
            "yavapai",
            135
        ],
        [
            "taliesi",
            135
        ],
        [
            "penland",
            135
        ],
        [
            "ncp",
            135
        ],
        [
            "hrefhttpscalendarkennesawedueventmountainsvalleysview",
            135
        ],
        [
            "making",
            134
        ],
        [
            "programming",
            134
        ],
        [
            "criminal",
            134
        ],
        [
            "needed",
            134
        ],
        [
            "throughout",
            134
        ],
        [
            "role",
            134
        ],
        [
            "openings",
            134
        ],
        [
            "sec",
            134
        ],
        [
            "convocation",
            133
        ],
        [
            "regarding",
            133
        ],
        [
            "26",
            133
        ],
        [
            "13",
            132
        ],
        [
            "dedicated",
            132
        ],
        [
            "assessment",
            132
        ],
        [
            "companies",
            132
        ],
        [
            "relevant",
            132
        ],
        [
            "operations",
            131
        ],
        [
            "21",
            131
        ],
        [
            "visual",
            131
        ],
        [
            "collaboration",
            130
        ],
        [
            "handson",
            130
        ],
        [
            "flight",
            130
        ],
        [
            "inclusive",
            129
        ],
        [
            "chairs",
            129
        ],
        [
            "earn",
            129
        ],
        [
            "agencies",
            129
        ],
        [
            "2019",
            129
        ],
        [
            "thursday",
            129
        ],
        [
            "tutoring",
            129
        ],
        [
            "strategies",
            129
        ],
        [
            "challenges",
            128
        ],
        [
            "ensure",
            128
        ],
        [
            "tickets",
            128
        ],
        [
            "fame",
            128
        ],
        [
            "mar",
            128
        ],
        [
            "details",
            127
        ],
        [
            "physical",
            127
        ],
        [
            "approved",
            127
        ],
        [
            "checking",
            127
        ],
        [
            "upcoming",
            126
        ],
        [
            "specialist",
            126
        ],
        [
            "conference",
            126
        ],
        [
            "august",
            126
        ],
        [
            "expanding",
            126
        ],
        [
            "standards",
            126
        ],
        [
            "institutional",
            125
        ],
